ERM/src/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов/ПубличныеИдентификаторыСинхронизируемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</name>
  <dimensions>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/CommonModules/rgsОбменДокументамиERMПовтИспСеанс/Ext/Module.bsl
Функция ПолучитьУзелLogelco() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменДокументамиLogelcoERM.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменДокументамиLogelcoERM КАК rgsОбменДокументамиLogelcoERM
		|ГДЕ
		|	НЕ rgsОбменДокументамиLogelcoERM.ЭтотУзел
		|	И НЕ rgsОбменДокументамиLogelcoERM.ПометкаУдаления
		|	И rgsОбменДокументамиLogelcoERM.Код = ""SL""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ПолучитьУзелBilling() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменДокументамиLogelcoERM.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменДокументамиLogelcoERM КАК rgsОбменДокументамиLogelcoERM
		|ГДЕ
		|	НЕ rgsОбменДокументамиLogelcoERM.ЭтотУзел
		|	И НЕ rgsОбменДокументамиLogelcoERM.ПометкаУдаления
		|	И rgsОбменДокументамиLogelcoERM.Код = ""BL""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ДанныеОбмена(Ссылка, Биллинг) Экспорт
	
	ЗапросЭлементОбмена = Новый Запрос;
	ЗапросЭлементОбмена.Текст = "ВЫБРАТЬ
	                            |	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	                            |ИЗ
	                            |	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	                            |ГДЕ
	                            |	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка = &Ссылка
	                            |	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &Биллинг";
	ЗапросЭлементОбмена.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросЭлементОбмена.УстановитьПараметр("Биллинг", Биллинг);
	
	Результат = ЗапросЭлементОбмена.Выполнить().Выгрузить();
	Возврат Результат
	
КонецФункции
